In [1]:
import pandas as pd
import numpy as np

In [2]:
df =pd.read_csv('credit_scoring_eng.csv')
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [4]:
df.shape

(21525, 12)

In [5]:
df.sample(5)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
10602,2,-546.093743,54,secondary education,1,married,0,M,employee,0,23689.728,purchase of my own house
17033,1,-3085.507506,44,SECONDARY EDUCATION,1,unmarried,4,F,business,0,48850.248,transactions with my real estate
15379,2,-891.505415,39,secondary education,1,civil partnership,1,M,employee,0,13657.015,having a wedding
12775,1,-2296.885736,48,bachelor's degree,0,married,0,F,business,0,41269.908,housing renovation
90,2,NaN,35,bachelor's degree,0,married,0,F,employee,0,NaN,housing transactions

In [6]:
df.describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21525.000000,19351.000000,21525.000000,21525.000000,21525.000000,21525.000000,19351.000000
mean,0.538908,63046.497661,43.293380,0.817236,0.972544,0.080883,26787.568355
std,1.381587,140827.311974,12.574584,0.548138,1.420324,0.272661,16475.450632
min,-1.000000,-18388.949901,0.000000,0.000000,0.000000,0.000000,3306.762000
25%,0.000000,-2747.423625,33.000000,1.000000,0.000000,0.000000,16488.504500
50%,0.000000,-1203.369529,42.000000,1.000000,0.000000,0.000000,23202.870000
75%,1.000000,-291.095954,53.000000,1.000000,1.000000,0.000000,32549.611000
max,20.000000,401755.400475,75.000000,4.000000,4.000000,1.000000,362496.645000

In [74]:
df.columns

Index(['children', 'dob_years', 'education', 'education_id', 'family_status',
       'family_status_id', 'gender', 'income_type', 'debt', 'total_income',
       'purpose'],
      dtype='object')

In [8]:
df.drop(['days_employed'], axis=1, inplace=True)

In [9]:
df['education'].value_counts()

secondary education    13750
bachelor's degree       4718
SECONDARY EDUCATION      772
Secondary Education      711
some college             668
BACHELOR'S DEGREE        274
Bachelor's Degree        268
primary education        250
Some College              47
SOME COLLEGE              29
PRIMARY EDUCATION         17
Primary Education         15
graduate degree            4
Graduate Degree            1
GRADUATE DEGREE            1
Name: education, dtype: int64

In [10]:
df['education'] = df['education'].str.lower()

In [11]:
df['family_status'].value_counts()

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widow / widower        960
Name: family_status, dtype: int64

In [12]:
df['gender'].value_counts()
print(df.loc[df.gender == 'XNA'])

       children  dob_years     education  education_id      family_status  \
10701         0         24  some college             2  civil partnership

       family_status_id gender income_type  debt  total_income  \
10701                 1    XNA    business     0     32624.825

               purpose
10701  buy real estate

In [13]:
df['income_type'].value_counts()

employee                       11119
business                        5085
retiree                         3856
civil servant                   1459
entrepreneur                       2
unemployed                         2
paternity / maternity leave        1
student                            1
Name: income_type, dtype: int64

In [14]:
df['debt'].value_counts()

0    19784
1     1741
Name: debt, dtype: int64

In [15]:
df.total_income.describe()

count     19351.000000
mean      26787.568355
std       16475.450632
min        3306.762000
25%       16488.504500
50%       23202.870000
75%       32549.611000
max      362496.645000
Name: total_income, dtype: float64

In [16]:
df['dob_years'].unique()

array([42, 36, 33, 32, 53, 27, 43, 50, 35, 41, 40, 65, 54, 56, 26, 48, 24,
       21, 57, 67, 28, 63, 62, 47, 34, 68, 25, 31, 30, 20, 49, 37, 45, 61,
       64, 44, 52, 46, 23, 38, 39, 51,  0, 59, 29, 60, 55, 58, 71, 22, 73,
       66, 69, 19, 72, 70, 74, 75], dtype=int64)

In [17]:
df['dob_years'].describe()

count    21525.000000
mean        43.293380
std         12.574584
min          0.000000
25%         33.000000
50%         42.000000
75%         53.000000
max         75.000000
Name: dob_years, dtype: float64

In [18]:
df['family_status_id'].value_counts()

0    12380
1     4177
4     2813
3     1195
2      960
Name: family_status_id, dtype: int64

In [19]:
df['education_id'].value_counts()

1    15233
0     5260
2      744
3      282
4        6
Name: education_id, dtype: int64

In [20]:
#count number of nulls in every column
df.isnull().sum()

children               0
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

In [21]:
#fill nulls with 0 along columns
df.fillna(value=0, axis=1, inplace=True)

In [22]:
df.loc[df['dob_years'] == 0]

,children,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
99,0,0,secondary education,1,married,0,F,retiree,0,11406.644,car
149,0,0,secondary education,1,divorced,3,F,employee,0,11228.230,housing transactions
270,3,0,secondary education,1,married,0,F,employee,0,16346.633,housing renovation
578,0,0,secondary education,1,married,0,F,retiree,0,15619.310,construction of own property
1040,0,0,bachelor's degree,0,divorced,3,F,business,0,48639.062,to own a car
...,...,...,...,...,...,...,...,...,...,...,...
19829,0,0,secondary education,1,married,0,F,employee,0,0.000,housing
20462,0,0,secondary education,1,married,0,F,retiree,0,41471.027,purchase of my own house
20577,0,0,secondary education,1,unmarried,4,F,retiree,0,20766.202,property
21179,2,0,bachelor's degree,0,married,0,M,business,0,38512.321,building a real estate
21313,0,0,secondary education,1,unmarried,4,M,employee,0,24387.070,housing transactions

In [23]:
df.loc[df['dob_years'] == 0, 'dob_years'] = df['dob_years'].median() 
df['dob_years'].describe()

count    21525.000000
mean        43.490453
std         12.218595
min         19.000000
25%         34.000000
50%         42.000000
75%         53.000000
max         75.000000
Name: dob_years, dtype: float64

In [24]:
#Change data types:
#dob_years to integer
df['dob_years'] = df['dob_years'].astype(np.int64)

In [25]:
df['gender'] = df['gender'].astype('category')
df.gender.dtype

CategoricalDtype(categories=['F', 'M', 'XNA'], ordered=False)

In [26]:
df['education'] = df['education'].astype('category')

In [39]:
df.purpose.nunique()

38

In [27]:
df['purpose'].value_counts()

wedding ceremony                            797
having a wedding                            777
to have a wedding                           774
real estate transactions                    676
buy commercial real estate                  664
housing transactions                        653
buying property for renting out             653
transactions with commercial real estate    651
purchase of the house                       647
housing                                     647
purchase of the house for my family         641
construction of own property                635
property                                    634
transactions with my real estate            630
building a real estate                      626
buy real estate                             624
purchase of my own house                    620
building a property                         620
housing renovation                          612
buy residential real estate                 607
buying my own car                           505
going to university                         496
car                                         495
second-hand car purchase                    489
to own a car                                480
buying a second-hand car                    479
cars                                        478
to buy a car                                472
car purchase                                462
supplementary education                     462
purchase of a car                           455
university education                        453
to get a supplementary education            447
education                                   447
getting an education                        443
profile education                           436
getting higher education                    426
to become educated                          412
Name: purpose, dtype: int64

In [28]:
df['income_type'] = df['income_type'].astype('category')

In [29]:
df['family_status'] = df['family_status'].astype('category')

In [30]:
df.dtypes

children               int64
dob_years              int64
education           category
education_id           int64
family_status       category
family_status_id       int64
gender              category
income_type         category
debt                   int64
total_income         float64
purpose               object
dtype: object

In [33]:
#Stemming and lemmatization
queries = list(df['purpose'])
print(type(queries))
queries[:10]

<class 'list'>

['purchase of the house',
 'car purchase',
 'purchase of the house',
 'supplementary education',
 'to have a wedding',
 'purchase of the house',
 'housing transactions',
 'education',
 'having a wedding',
 'purchase of the house for my family']

In [56]:
counter = 0
for query in queries:
    if 'housing' in query:
        counter += 1
print(counter)

1912

In [44]:
from nltk.stem import SnowballStemmer 
english_stemmer = SnowballStemmer('english')
words = queries
for word in words:
    for each in word.split(' '):
        #print('Source word -', word, ', after stemming -', english_stemmer.stem(each))

SyntaxError: unexpected EOF while parsing (<ipython-input-44-16f4e3d8d1c3>, line 6)

In [37]:
educ_counter = 0
for query in queries:
    for word in query.split(' '):
        stemmed_word = english_stemmer.stem(word)
        if stemmed_word == 'educ':
            counter += 1
print(counter)

11530

In [38]:
property_counter = 0
for query in queries:
    for word in query.split(' '):
        stemmed_word = english_stemmer.stem(word)
        if stemmed_word == 'properti':
            counter += 1
print(counter)

14072

In [ ]:
cat = []

In [69]:
for query in queries:
    if 'educated' in query:
        cat.append('Education')

In [70]:
print(len(cat))

21978

In [75]:
df.duplicated().sum()

72